import sys
x=str(sys.argv[1:])
if len(sys.argv)>1:
 x=(x[2:(len(x)-2):1])
 x=list(x)
 x.reverse()
 x=str(x)
 x=x.replace("'","").replace(",","").replace("[","").replace("]","")
 print (x)
else:
 print ('Please input more then zero numbers')

 # Довільна, відмінна від нуля, кількість значень - аргументів командного рядка. Значеннями-аргументами можуть бути числа або рядки, які складаються з цифр та літер латинського алфавіту без пробілів.
 # Рядок, що складається з отриманих значень в зворотньому порядку, записаних через пробіл. Пробіл в кінці рядка відсутній.