import sys
a1=int(sys.argv[1])
a2=int(sys.argv[2])
z=0
q=0
if 0<=a1<=a2<=999999:
  while a1<=a2:
    a1=str(a1)
    a1=a1.zfill(6)
    x=int(a1[0])+int(a1[1])+int(a1[2])
    y=int(a1[3])+int(a1[4])+int(a1[5])
    if x==y:
      z+=1
      q=(a1)
      print ("Щасливий квиток:", q)
    a1=int(a1)
    a1+=1
else:
 print ("Введений аргумент не задовольняє умову 0<=a1<=a2<=999999. Будь ласка, повторіть спробу")
print ("Кількість щасливих квитків:", z)
print ("Щасливий квиток:", q)

# Два цілих невід'ємних числа (0<=a1<=a2<=999999) - аргументи командного рядка.
# Пошук кількості "щасливих квитків", чиї номери лежать на проміжку від a1 до a2 включно. Якщо число на проміжку має менше 6 розрядів, вважати, що на його початку дописуються нулі у необхідній кількості, як це і відбувається при нумерації квитків. Виводити номери квитків не треба.